misterniark/Meshpay-V2/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Waveshare ESP32-S3-Touch-LCD-1.47 uses 8 MB octal PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_PM_ENABLE=y

# Default S3 smoke target: Waveshare ESP32-S3 Touch LCD wallet profile.
# CONFIG_MESHPAY_BOARD_UNKNOWN is not set
CONFIG_MESHPAY_BOARD_WAVESHARE_S3_TOUCH=y
# CONFIG_MESHPAY_RADIO_DISABLED is not set
CONFIG_MESHPAY_RADIO_ESPNOW_LORA_CORE1262=y
# Provisoire : tout le trafic Reticulum (announce + DAG) sur ESP-NOW, rien sur LoRa.
# Le bearer LoRa reste configuré/initialisé ; repasser à =n pour réactiver LoRa.
CONFIG_MESHPAY_FORCE_ESPNOW_ONLY=y
CONFIG_MESHPAY_ESPNOW_CHANNEL=1
CONFIG_MESHPAY_LORA_C1262_SPI_HOST=2
CONFIG_MESHPAY_LORA_C1262_PIN_SCK=1
CONFIG_MESHPAY_LORA_C1262_PIN_MOSI=2
CONFIG_MESHPAY_LORA_C1262_PIN_MISO=10
CONFIG_MESHPAY_LORA_C1262_PIN_NSS=4
CONFIG_MESHPAY_LORA_C1262_PIN_RESET=5
CONFIG_MESHPAY_LORA_C1262_PIN_BUSY=6
CONFIG_MESHPAY_LORA_C1262_PIN_DIO1=7
CONFIG_MESHPAY_LORA_C1262_PIN_RXEN=8
CONFIG_MESHPAY_LORA_C1262_PIN_TXEN=9
CONFIG_MESHPAY_LORA_C1262_PIN_AUX_CS=-1
CONFIG_MESHPAY_LORA_C1262_FREQUENCY_HZ=868100000
CONFIG_MESHPAY_LORA_C1262_TCXO_CTRL_VOLTAGE=2
CONFIG_MESHPAY_LORA_C1262_CALIBRATE_IMAGE=y
CONFIG_MESHPAY_LORA_C1262_TX_POWER_DBM=14
